In [44]:
import pandas as pd 
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
from sklearn import tree
from sklearn import preprocessing

In [45]:
titanic_train = pd.read_csv('train.csv')

In [46]:
titanic_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [47]:
titanic_train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 889 entries, 0 to 888
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  889 non-null    int64
 1   Survived     889 non-null    int64
 2   Pclass       889 non-null    int64
 3   Name         889 non-null    object
 4   Sex          889 non-null    object
 5   Age          889 non-null    float64
 6   SibSp        889 non-null    int64
 7   Parch        889 non-null    int64
 8   Ticket       889 non-null    object
 9   Fare         889 non-null    float64
 10  Cabin        202 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.5+ KB

In [48]:
titanic_train.count()

PassengerId    889
Survived       889
Pclass         889
Name           889
Sex            889
Age            889
SibSp          889
Parch          889
Ticket         889
Fare           889
Cabin          202
Embarked       889
dtype: int64

In [49]:
titanic_train.isna()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,False,False,False,False,False,False,False,False,False,False,True,False
1,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,True,False
3,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,True,False
...,...,...,...,...,...,...,...,...,...,...,...,...
884,False,False,False,False,False,False,False,False,False,False,True,False
885,False,False,False,False,False,False,False,False,False,False,False,False
886,False,False,False,False,False,False,False,False,False,False,True,False
887,False,False,False,False,False,False,False,False,False,False,False,False
888,False,False,False,False,False,False,False,False,False,False,True,False

In [50]:
titanic_train['Age'].mean()

32.69985376827896

In [51]:
new_age_var = np.where(titanic_train['Age'].isnull(),32,titanic_train['Age'])

In [52]:
titanic_train[titanic_train['Age'].isnull()]

Empty DataFrame
Columns: [PassengerId, Survived, Pclass, Name, Sex, Age, SibSp, Parch, Ticket, Fare, Cabin, Embarked]
Index: []

In [53]:
titanic_train['Age'] = new_age_var

In [54]:
titanic_train[titanic_train['Age'] == 32]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
69,71,0,2,"Jenkin, Mr. Stephen Curnow",male,32.0,0,0,C.A. 33111,10.5000,NaN,S
73,75,1,3,"Bing, Mr. Lee",male,32.0,0,0,1601,56.4958,NaN,S
189,191,1,2,"Pinsky, Mrs. (Rosa)",female,32.0,0,0,234604,13.0000,NaN,S
205,207,0,3,"Backstrom, Mr. Karl Alfred",male,32.0,1,0,3101278,15.8500,NaN,S
217,219,1,1,"Bazzani, Miss. Albina",female,32.0,0,0,11813,76.2917,D15,C
381,383,0,3,"Tikkanen, Mr. Juho",male,32.0,0,0,STON/O 2. 3101293,7.9250,NaN,S
428,430,1,3,"Pickard, Mr. Berk (Berk Trembisky)",male,32.0,0,0,SOTON/O.Q. 392078,8.0500,E10,S
518,520,0,3,"Pavlovic, Mr. Stefo",male,32.0,0,0,349242,7.8958,NaN,S
542,544,1,2,"Beane, Mr. Edward",male,32.0,1,0,2908,26.0000,NaN,S
568,570,1,3,"Jonsson, Mr. Carl",male,32.0,0,0,350417,7.8542,NaN,S
578,580,1,3,"Jussila, Mr. Eiriik",male,32.0,0,0,STON/O 2. 3101286,7.9250,NaN,S
631,633,1,1,"Stahelin-Maeglin, Dr. Max",male,32.0,0,0,13214,30.5000,B50,C
635,637,0,3,"Leinonen, Mr. Antti Gustaf",male,32.0,0,0,STON/O 2. 3101292,7.9250,NaN,S
656,658,0,3,"Bourke, Mrs. John (Catherine)",female,32.0,1,1,364849,15.5000,NaN,Q
664,666,0,2,"Hickman, Mr. Lewis",male,32.0,2,0,S.O.C. 14879,73.5000,NaN,S
768,770,0,3,"Gronnestad, Mr. Daniel Danielsen",male,32.0,0,0,8471,8.3625,NaN,S
836,839,1,3,"Chip, Mr. Chang",male,32.0,0,0,1601,56.4958,NaN,S
888,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [55]:
label_encoder= preprocessing.LabelEncoder()

In [56]:
encoded_sex = label_encoder.fit_transform(titanic_train['Sex'])

In [57]:
tree_model = tree.DecisionTreeClassifier()

In [61]:
tree_model.fit(X=pd.DataFrame(encoded_sex), y=titanic_train['Survived'])

DecisionTreeClassifier()

In [62]:
with open('Dtree1.dot','w') as f:
    f = tree.export_graphviz(tree_model,feature_names=['Sex'] , out_file=f);

In [63]:
predictors = pd.DataFrame([encoded_sex, titanic_train['Pclass']]).T

In [64]:
tree_model.fit(X=predictors , y= titanic_train['Survived'])

DecisionTreeClassifier()

In [65]:
with open('Dtree2.dot' , 'w') as f:
    f= tree.export_graphviz(tree_model,feature_names=['Sex', 'Pclass'] , out_file= f);

In [72]:
predictors = pd.DataFrame([encoded_sex, titanic_train['Pclass'], titanic_train['Age'] , titanic_train['Fare'] ]).T

In [73]:
tree_model = tree.DecisionTreeClassifier(max_depth= 8)

In [74]:
tree_model.fit(X=predictors, y = titanic_train['Survived'])

DecisionTreeClassifier(max_depth=8)

In [75]:
with open('Dtree3.dot','w') as f:
    f = tree.export_graphviz(tree_model,feature_names=['Sex','Pclass','Age', 'Fare'] , out_file=f);

### loading test data

In [76]:
titanic_test = pd.read_csv('test.csv')

In [77]:
titanic_test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,S

In [78]:
new_age_var = np.where ( titanic_test['Age'].isnull() , 28 , titanic_test['Age'] )

In [79]:
titanic_test['Age'] = new_age_var

In [80]:
encoded_sex_test = label_encoder.fit_transform(titanic_test['Sex'])

In [81]:
test_features = pd.DataFrame( [encoded_sex_test, titanic_test['Age'] , titanic_test['Pclass'] , titanic_test['Fare']  ]).T

In [82]:
test_preds = tree_model.predict(X= test_features)

In [84]:
predicted_output = pd.DataFrame( {'PassengerId' : titanic_test['PassengerId'], "Survived" : test_preds})

In [85]:
predicted_output.to_csv('Output.csv', index = False);

# Random Forest

In [87]:
titanic_train.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [88]:
from sklearn.ensemble import RandomForestClassifier

In [89]:
label_encoder = preprocessing.LabelEncoder( )

In [91]:
titanic_train['Sex'] = label_encoder.fit_transform(titanic_train['Sex'])

In [92]:
titanic_train['Embarked'] = label_encoder.fit_transform(titanic_train['Embarked'])

In [104]:
rf_model = RandomForestClassifier(n_estimators=1000 , max_features= 2 , oob_score= True)

In [105]:
features = ['Pclass', 'Sex', 'Age', 'SibSp', 'Fare',  'Embarked']

In [106]:
rf_model.fit(X= titanic_train[features], y = titanic_train['Survived'])

RandomForestClassifier(max_features=2, n_estimators=1000, oob_score=True)

In [107]:
print('OOB Accuracy : ')

OOB Accuracy :

In [108]:
print(rf_model.oob_score_)

0.8110236220472441

In [109]:
for features, imp in zip(features,rf_model.feature_importances_):
    print(features,imp)

Pclass 0.08798419930329501
Sex 0.2691646604972554
Age 0.2698079950988692
SibSp 0.05235002140633853
Fare 0.28617611566381596
Embarked 0.034517008030425865

## So now we are considering only Gender , Fare , Age to see the accuracy of Decision Tree

In [119]:
predictors = pd.DataFrame([encoded_sex,  titanic_train['Age'],titanic_train['Fare']  ]).T

In [120]:
tree_model = tree.DecisionTreeClassifier()

In [121]:
tree_model.fit(X=predictors, y = titanic_train['Survived'])

DecisionTreeClassifier()

In [122]:
with open('Dtree4.dot','w') as f:
    f = tree.export_graphviz(tree_model,feature_names=['Sex','Age', 'Fare'] , out_file=f);

In [123]:
tree_model.score(X= predictors , y = titanic_train['Survived'])

0.9763779527559056

## Now the model accuracy boosted to 97 % . Hence we can clearly say that Random forest helps in analying the important features for Decision Tree.